benchmarks/http_suite_20260323_200437/wrk_echo_content_length_c256.wrk.out
Running 5s test @ http://127.0.0.1:18080/echo
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.05ms    2.56ms  33.27ms   73.67%
    Req/Sec     5.32k   595.34     6.80k    73.50%
  Latency Distribution
     50%    5.24ms
     75%    7.76ms
     90%    9.40ms
     99%   13.91ms
  212099 requests in 5.03s, 26.70MB read
Requests/sec:  42195.32
Transfer/sec:      5.31MB